import os
from dotenv import load_dotenv


load_dotenv()
ALL_RANGES = ('のみ', '以上', '以下')
ALL_RULES = ('シングル', 'ダブル')
ALL_SORTS = ('新着順', '順位順')
NATURE_TABLE = {
    'increased': {
        'こうげき': ['さみしがり', 'いじっぱり', 'やんちゃ', 'ゆうかん'],
        'ぼうぎょ': ['ずぶとい', 'わんぱく', 'のうてんき', 'のんき'],
        'とくこう': ['ひかえめ', 'おっとり', 'うっかりや', 'れいせい'],
        'とくぼう': ['おだやか', 'おとなしい', 'しんちょう', 'なまいき'],
        'すばやさ': ['おくびょう', 'せっかち', 'ようき', 'むじゃき']
    },
    'decreased': {
        'こうげき': ['ずぶとい', 'ひかえめ', 'おだやか', 'おくびょう'],
        'ぼうぎょ': ['さみしがり', 'おっとり', 'おとなしい', 'せっかち'],
        'とくこう': ['いじっぱり', 'わんぱく', 'しんちょう', 'ようき'],
        'とくぼう': ['やんちゃ', 'のうてんき', 'うっかりや', 'むじゃき'],
        'すばやさ': ['ゆうかん', 'のんき', 'れいせい', 'なまいき']
    }
}
SECRET_TOKEN = os.environ.get('SECRET_TOKEN')
